<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>陣列</title>
</head>

<body>

    <?php
    $transcript = [
        "王大明" => ["國文" => 95, "英文" => 64, "數學" => 70, "地理" => 90, "歷史" => 84], 
        "李小王"  => ["國文" => 88, "英文" => 78, "數學" => 54, "地理" => 81, "歷史" => 71], 
        "張中李" => ["國文" => 45, "英文" => 60, "數學" => 68, "地理" => 70, "歷史" => 62],
        "黃大明" => ["國文" => 59, "英文" => 32, "數學" => 77, "地理" => 54, "歷史" => 42],
        "明小李" => ["國文" => 71, "英文" => 62, "數學" => 80, "地理" => 62, "歷史" => 64]
    ];

    ?>
</body>

</html>